docs: remove colors from architecture diagram
